# GetDescriptionText Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageAccessor..::..GetDescriptionText Method
FailureMessageAccessor Class See Also
---
Retrieves the description of the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetDescriptionText()
```

Visual Basic
---
```text
Public Function GetDescriptionText As String
```

Visual C++
---
```text
public:
String^ GetDescriptionText()
```

# ### Return Value
The description text.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace